spec/fixtures/cassettes/invoices_get_in_tUCMhwlg2nkvAaL.yml

---
http_interactions:
- request:
    method: get
    uri: https://sandbox.espago.com/api/invoices/in_tUCMhwlg2nkvAaL
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - application/vnd.espago.v2+json
      Authorization:
      - Basic YXBwX2lkX3Rlc3Q6YXBwX3Bhc3N3b3JkX3Rlc3Q=
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Type:
      - application/json; charset=utf-8
      X-Meta-Request-Version:
      - 0.2.2
      X-Ua-Compatible:
      - IE=Edge
      Etag:
      - '"8228e345e129c733224bf3c67d8b777d"'
      Cache-Control:
      - max-age=0, private, must-revalidate
      Set-Cookie:
      - _session_id=fc3e23905f980048539cddb0af8d61b6; path=/; HttpOnly
      X-Request-Id:
      - 0244064aeaddadd8b7d292aad142abe7
      X-Runtime:
      - '0.532100'
      Connection:
      - close
      Server:
      - thin 1.5.0 codename Knife
    body:
      encoding: UTF-8
      string: '{"id":"in_tUCMhwlg2nkvAaL","date":1417030496,"client":"cli_90Pi6Jf0ndl_PP","subscription":"sub_8yYuCBKdywr7e2","amount":"123.45","currency":"pln","paid":true,"issuer_response_code":"00","attempts":1,"next_payment_attempt":null,"created_at":1417030497}'
    http_version:
  recorded_at: Wed, 26 Nov 2014 19:50:19 GMT
recorded_with: VCR 2.9.3
